In [1]:
#setting range
for i in range(0,100):
    print(i,end=",")

0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,

In [2]:
#range start, stop, step by(can be a table or addition n all)
for i in range(0, 100, 7): 
     print(i,end=",")

0,7,14,21,28,35,42,49,56,63,70,77,84,91,98,

In [3]:
#only even number or 2 table
for i in range(2, 100, 2):
    print(i,end=",")

2,4,6,8,10,12,14,16,18,20,22,24,26,28,30,32,34,36,38,40,42,44,46,48,50,52,54,56,58,60,62,64,66,68,70,72,74,76,78,80,82,84,86,88,90,92,94,96,98,

In [4]:
#sum of each number till 100
n=100
sum = 0
for counter in range(1,n+1):
    sum = sum + counter
sum

5050

In [5]:
import pandas as pd
import numpy as np

In [6]:
#making and combining array
a = np.array([1,2,3,4,5,6,7,8,9,10])
b = np.array([11,12,13,14,15,16,17,18,19,20])
x = pd.DataFrame(b,a)

In [7]:
print(x)

     0
1   11
2   12
3   13
4   14
5   15
6   16
7   17
8   18
9   19
10  20

In [8]:
#shifting by the value of 2
y = x.shift(2)

In [9]:
print(y)

       0
1    NaN
2    NaN
3   11.0
4   12.0
5   13.0
6   14.0
7   15.0
8   16.0
9   17.0
10  18.0

In [10]:
#screenout only odd
print(x[::2])

    0
1  11
3  13
5  15
7  17
9  19

In [11]:
#screenout only even
print(x[1::2])

     0
2   12
4   14
6   16
8   18
10  20

In [12]:
#diffrencing
diff = x-x.shift(1)
print(diff)

      0
1   NaN
2   1.0
3   1.0
4   1.0
5   1.0
6   1.0
7   1.0
8   1.0
9   1.0
10  1.0

In [13]:
table1 = pd.DataFrame({'A': ['c', 'c', 'c', 'j', 'k', 'l', 'l', 'x', 'z'],
                       'b': [1, 2, 5, 2, 3, 3, 4, 2, 1]})
table1

   A  b
0  c  1
1  c  2
2  c  5
3  j  2
4  k  3
5  l  3
6  l  4
7  x  2
8  z  1

In [14]:
table2 = pd.DataFrame({'A': ['c', 'c', 'd', 'd', 'l', 'x', 'x', 'r'],
                       'b': [1, 2, 2, 3, 1, 2, 3, 2]})
table2

   A  b
0  c  1
1  c  2
2  d  2
3  d  3
4  l  1
5  x  2
6  x  3
7  r  2

In [15]:
pd.merge(table1,table2,on=["A"],how='left')

    A  b_x  b_y
0   c    1  1.0
1   c    1  2.0
2   c    2  1.0
3   c    2  2.0
4   c    5  1.0
5   c    5  2.0
6   j    2  NaN
7   k    3  NaN
8   l    3  1.0
9   l    4  1.0
10  x    2  2.0
11  x    2  3.0
12  z    1  NaN

In [16]:
pd.merge(table1,table2,on=["A"],how='right')

    A  b_x  b_y
0   c  1.0    1
1   c  2.0    1
2   c  5.0    1
3   c  1.0    2
4   c  2.0    2
5   c  5.0    2
6   d  NaN    2
7   d  NaN    3
8   l  3.0    1
9   l  4.0    1
10  x  2.0    2
11  x  2.0    3
12  r  NaN    2

In [17]:
pd.merge(table1,table2,on=["A"],how='inner')

   A  b_x  b_y
0  c    1    1
1  c    1    2
2  c    2    1
3  c    2    2
4  c    5    1
5  c    5    2
6  l    3    1
7  l    4    1
8  x    2    2
9  x    2    3

In [18]:
"Shaurya Vashsith"[::-1]

'htishsaV ayruahS'

In [19]:
list_1 = [1,3,5,7,9]
list_2 = [2,4,6,8,10]
for i,k in zip(list_1,list_2):
    print(i,k)

1 2
3 4
5 6
7 8
9 10

In [20]:
list_1.append(11)
list_1

[1, 3, 5, 7, 9, 11]

In [21]:
list_1.pop()
list_1

[1, 3, 5, 7, 9]

In [22]:
list_2.insert(1,7)
list_2

[2, 7, 4, 6, 8, 10]

In [23]:
list_2.reverse()
list_2

[10, 8, 6, 4, 7, 2]

In [24]:
list_2.sort()
list_2

[2, 4, 6, 7, 8, 10]

In [9]:
# count from a list
list_1 = ["a","a","a","c","v","b","n","a","q","w","e","a","r","t","a","V","v","c"]
list_1.count("a")

6

In [10]:
# remove duplicates from list
list(set(list_1))

['r', 'w', 'b', 'e', 'n', 'a', 'v', 'c', 'V', 't', 'q']

In [11]:
# print duplicates
for i in list(set(list_1)):
    if list_1.count(i)>1:
        print(i)

a
v
c

In [1]:
## names that start with character "j"?
names= ["john", "fan", "sam", "megha", "popeye", "tom", "jane", "james","tony"]
print([name for name in names if name[0]=='j'])

['john', 'jane', 'james']

In [7]:
import pandas as pd
pd.DataFrame({'names':names})['names'].str.contains("to|ja|ha")

0    False
1    False
2    False
3     True
4    False
5     True
6     True
7     True
8     True
Name: names, dtype: bool

In [6]:
"shaurya".count('a')

2

In [7]:
dishes = ['soup','salad','sandwich','pasta']
combo = []

for i in range(len(dishes)):
    for j in range(i+1,len(dishes)):
        combo.append((dishes[i],dishes[j]))
combo

[('soup', 'salad'),
 ('soup', 'sandwich'),
 ('soup', 'pasta'),
 ('salad', 'sandwich'),
 ('salad', 'pasta'),
 ('sandwich', 'pasta')]

In [10]:
# Given a square matrix mat of size n x n. 
# The task is to rotate it by 90 degrees in an anti-clockwise direction without using any extra space.
mat = [[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]]
# Output: Rotated Matrix
# [[3, 6, 9],
# [2, 5, 8],
# [1, 4, 7]]
new_dict = []
for i in mat:
    new_dict.append(i[::-1])
[list(row) for row in zip(*new_dict)]

[[3, 6, 9], [2, 5, 8], [1, 4, 7]]

In [1]:
list_1 = {"class_2":"random","class_3":"vashisth","class_1":"shaurya"}
new_dict = {}
keys = list(list_1.keys())
for k, i in enumerate(list_1.values()):
    new_dict[keys[k]] = "".join(value.upper() if num % 2 == 0 else value.lower() for num, value in enumerate(i))
new_dict

{'class_2': 'RaNdOm', 'class_3': 'VaShIsTh', 'class_1': 'ShAuRyA'}

In [8]:
Student = ['Ayush', 'Tarun', 'Rohit', 'Muskan', 'Aman']
Mathematics = [90, 100, 90, 80, 80]
English = [50, 80, 60, 65, 75]
Science = [90, 80, 70, 80, 'NA']
df = pd.DataFrame({'Student':Student,
              'Mathematics':Mathematics,
              'English':English,
              'Science':Science})
df =df.replace('NA',0)
df

  Student  Mathematics  English  Science
0   Ayush           90       50       90
1   Tarun          100       80       80
2   Rohit           90       60       70
3  Muskan           80       65       80
4    Aman           80       75        0

In [9]:
row_means = df.replace(0, np.nan).mean(axis=1)
df = df.where(df != 0, row_means, axis=0).reset_index()
df

C:\Users\shaur\AppData\Local\Temp\ipykernel_22208\3988070775.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  row_means = df.replace(0, np.nan).mean(axis=1)

   index Student  Mathematics  English  Science
0      0   Ayush           90       50     90.0
1      1   Tarun          100       80     80.0
2      2   Rohit           90       60     70.0
3      3  Muskan           80       65     80.0
4      4    Aman           80       75     77.5

In [1]:
sentences = [
   "black is a color.",
   "The color black is often associated with elegance.",
   "The cat is named blackcat.",
   "blackjack is a popular card game.",
    "The black dog ran fast."]
# using list comprehension, you have to find out which sentences consist of the word "black"
[i for i in sentences if "black " in i]

['black is a color.',
 'The color black is often associated with elegance.',
 'The black dog ran fast.']

In [18]:
# Given two sorted arrays nums1 and nums2 of size m and n respectively, 
# return the median of the two sorted arrays. [without using list built-in methods]
nums1 = [2,46,3,15,6]
nums2 = [1,2,3,45]
def find_median(arr):
    arr.sort()
    mid = len(arr)//2
    if len(arr)%2==1:
        return arr[mid]
    else:
        return (arr[mid-1]+arr[mid])/2
find_median(nums2)

2.5

In [1]:
# Implement a function to check if two strings are anagrams of each other.
def anagram(srt_1,srt_2):
    if len(srt_1)==len(srt_2) and len([i for i in srt_1 if i in srt_2])==len(srt_2):
        return True
    else:
        return False
anagram("was","saw")

True

In [4]:
# You are given a sales table with columns: order_id, customer_id, order_date, order_amount. Write a SQL query to find the top 5 customers with the highest total sales in the last 12 months.
# select customer_id 
# from table 
# where order_date < date_sub(now(), interval 1 year)
# order by order_amount desc
# limit 5

In [1]:
list_1 = [1,2,3,4,5,6,7,8,9,10]
blank_list = []
for i in list_1:
    if i%2==0:
        blank_list.append(i**2)
blank_list

[4, 16, 36, 64, 100]

In [2]:
[i**2 for i in list_1 if i%2==0]

[4, 16, 36, 64, 100]

In [3]:
str_test = "my name is shaurya"
blank = ""
for i in str_test.split(" ")[::-1]:
    blank+= i+" "
blank

'shaurya is name my '

In [4]:
import pandas as pd
random_df = pd.DataFrame({"num_1":[1,2,3,4],"num_2":[1.0,2.0,3.0,4.0]})
random_df

   num_1  num_2
0      1    1.0
1      2    2.0
2      3    3.0
3      4    4.0

In [5]:
# check num2 >2 *10 else same
import numpy as np
random_df['num_3'] = np.where(random_df['num_2']>2,random_df['num_2']*10,random_df['num_2'])
random_df

   num_1  num_2  num_3
0      1    1.0    1.0
1      2    2.0    2.0
2      3    3.0   30.0
3      4    4.0   40.0

In [2]:
# factorial of 5
blank = 1
num = 5
for i in [*range(1,num+1)]:
    blank *= i
blank

120

In [1]:
#Abstraction with Inheritance
class class_1():
    def __init__(self):
        self.call_name = "class_1"

class class_2(class_1):
    def __init__(self):
        super().__init__()
        self.call_name_2 = "class_2"
call = class_2()
call.call_name

'class_1'

In [2]:
input_string = "hello world"
# {'h': 1, 'e': 1, 'l': 3, 'o': 2, ' ': 1, 'w': 1, 'r': 1, 'd': 1}

def count_str(str_1):
    blank={}
    for i in str_1:
        blank[i] = str_1.count(i)
    
    return blank

count_str(input_string)

{'h': 1, 'e': 1, 'l': 3, 'o': 2, ' ': 1, 'w': 1, 'r': 1, 'd': 1}

In [2]:
# use of decorator
def my_decorator(func):
    def wrapper():
        print("Something before the function runs.")
        func()
        print("Something after the function runs.")
    return wrapper

@my_decorator
def say_hello():
    print("Hello!")

say_hello()

Something before the function runs.
Hello!
Something after the function runs.

In [5]:
str_1 = "shaurya vashisth"

def get_unique_str(str_1):
    import pandas as pd
    blank = {}
    for i in str_1:
        blank[i] = str_1.count(i)
    temp_df = pd.DataFrame({'Keys':blank.keys(),'Values':blank.values()})
    return str(temp_df[temp_df['Values']<2].head(1)['Keys'].iloc[0])
get_unique_str(str_1)

'u'

In [2]:
list_1 = [1,2,5,4,8,56,3,2]
min_val = list_1[0]
max_val = list_1[0]
for i in list_1:
    if i < min_val:
        min_val = i
    if i > max_val:
        max_val = i
print(f"Range:- {max_val-min_val}")

Range:- 55